docs/ms-crm-files/CrmSoapRequest.xml

<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope"
	xmlns:a="http://www.w3.org/2005/08/addressing"
	xmlns:u="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
	<s:Header>
		<a:Action s:mustUnderstand="1">
			http://schemas.microsoft.com/xrm/2011/Contracts/Services/IOrganizationService/Retrieve
		</a:Action>
		<a:MessageID>
			urn:uuid:%MessageID% </a:MessageID>
		<a:ReplyTo>
			<a:Address>
				http://www.w3.org/2005/08/addressing/anonymous
			</a:Address>
		</a:ReplyTo>
		<VsDebuggerCausalityData
			xmlns="http://schemas.microsoft.com/vstudio/diagnostics/servicemodelsink">
			uIDPozJEz+P/wJdOhoN2XNauvYcAAAAAK0Y6fOjvMEqbgs9ivCmFPaZlxcAnCJ1GiX+Rpi09nSYACQAA
		</VsDebuggerCausalityData>
		<a:To s:mustUnderstand="1">https://8x8xtrial.crm5.dynamics.com/XRMServices/2011/Organization.svc
		</a:To>
		<o:Security s:mustUnderstand="1"
			xmlns:o="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
			<u:Timestamp u:Id="_0">
				<u:Created>%timeCreated%Z</u:Created>
				<u:Expires>%timeExpires%Z</u:Expires>
			</u:Timestamp>
			<EncryptedData Id="Assertion0"
				Type="http://www.w3.org/2001/04/xmlenc#Element" xmlns="http://www.w3.org/2001/04/xmlenc#">
				<EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#tripledes-cbc">
				</EncryptionMethod>
				<ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
					<EncryptedKey>
						<EncryptionMethod
							Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-oaep-mgf1p">
						</EncryptionMethod>
						<ds:KeyInfo Id="keyinfo">
							<wsse:SecurityTokenReference
								xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
								<wsse:KeyIdentifier
									EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary"
									ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509SubjectKeyIdentifier">%KeyIdentifier%</wsse:KeyIdentifier>
							</wsse:SecurityTokenReference>
						</ds:KeyInfo>
						<CipherData>
							<CipherValue>%SecurityToken0%</CipherValue>
						</CipherData>
					</EncryptedKey>
				</ds:KeyInfo>
				<CipherData>
					<CipherValue>%SecurityToken1%</CipherValue>
				</CipherData>
			</EncryptedData>
		</o:Security>
	</s:Header>
	<s:Body>
		<Retrieve xmlns="http://schemas.microsoft.com/xrm/2011/Contracts/Services">
			<entityName>account</entityName>
			<id>%AccountID%</id>
			<columnSet xmlns:b="http://schemas.microsoft.com/xrm/2011/Contracts"
				xmlns:i="http://www.w3.org/2001/XMLSchema-instance">
				<b:AllColumns>true</b:AllColumns>
			</columnSet>
		</Retrieve>
	</s:Body>
</s:Envelope>