src/CrmFetchKit.min.js

// CrmFetchKit.js 2.1.0
// http://crmfetchkit.codeplex.com/
// Daniel Thul <thuld@outlook.com> 
!function(e,t,a){"use strict";function r(){this.Id=null,this.logicalName=null,this.attributes={}}function n(){if(null===w)if("undefined"!=typeof GetGlobalContext)w=GetGlobalContext();else{if("undefined"==typeof Xrm)throw new Error("Context is not available.");w=Xrm.Page.context}return w}function i(){if(null===S){var t=null,r=e.location.protocol+"//"+e.location.host,i=n();Xrm.Page.context.getClientUrl!==a?t=Xrm.Page.context.getClientUrl():i.isOutlookClient()&&!i.isOutlookOnline()?t=r:(t=i.getServerUrl(),t=t.replace(/^(http|https):\/\/([_a-zA-Z0-9\-\.]+)(:([0-9]{1,5}))?/,r),t=t.replace(/\/$/,"")),S=t}return S}function o(e){var t=/(\d{4})-(\d\d)-(\d\d)T(\d\d):(\d\d):(\d\d)(\.\d+)?(Z|([+-])(\d\d):(\d\d))/,a=[];if(a=e.match(t),!a)throw"Couldn't parse ISO 8601 date string '"+e+"'";for(var r=[1,2,3,4,5,6,10,11],n=0,i=r.length;i>n;n++)a[r[n]]=parseInt(a[r[n]],10);a[7]=parseFloat(a[7]);var o=Date.UTC(a[1],a[2]-1,a[3],a[4],a[5],a[6]);if(a[7]>0&&(o+=Math.round(1e3*a[7])),"Z"!==a[8]&&a[10]){var s=60*a[10]*60*1e3;a[11]&&(s+=60*a[11]*1e3),"-"===a[9]?o-=s:o+=s}return new Date(o)}function s(e){for(var t,a,r,n,i,o,s=0;s<e.childNodes.length;s++)switch(o=e.childNodes[s],o.nodeName){case"a:EntityName":t=g(o);break;case"a:MoreRecords":a="true"===g(o);break;case"a:PagingCookie":r=g(o);break;case"a:TotalRecordCount":n=parseInt(g(o));break;case"a:Entities":i=o}return{entityName:t,moreRecords:a,pagingCookie:r,totalRecordCount:n}}function l(e){var t=h(e,"a:Entities").childNodes,a=s(e),r=$.map(t,m);return{entityName:a.entityName,moreRecords:a.moreRecords,pagingCookie:a.pagingCookie,totalRecordCount:a.totalRecordCount,entities:r}}function c(e,t){var a={type:e};switch(e){case"a:OptionSetValue":a.value=parseInt(g(t),10);break;case"a:EntityReference":a.guid=f(t,"a:Id"),a.name=f(t,"a:Name"),a.logicalName=f(t,"a:LogicalName");break;case"a:EntityCollection":a.value=l(t);break;case"a:Money":a.value=parseFloat(g(t),10);break;case"a:AliasedValue":var r=h(t,"a:Value"),n=v(r,"i:type");a=c(n,r);break;case"c:int":a.value=parseInt(g(t),10);break;case"c:decimal":a.value=parseFloat(g(t));break;case"c:dateTime":a.value=o(g(t));break;case"c:boolean":a.value="true"!==g(t)?!1:!0;break;default:a.value=g(t)}return a}function u(e){for(var t={},a=null,r=null,n=null,i=null,o=0,s=e.childNodes.length;s>o;o++)a=e.childNodes[o],r=f(a,"b:key"),i=h(a,"b:value"),n=v(i,"i:type"),t[r]=c(n,i);return t}function m(e){var t=new r,a=null,n=null,i=null,o=null;t.Id=f(e,"a:Id"),t.attributes=u(h(e,"a:Attributes")),t.logicalName=f(e,"a:LogicalName"),a=h(e,"a:FormattedValues").childNodes;for(var s=0,l=a.length;l>s;s++)n=a[s],i=f(n,"b:key"),o=f(n,"b:value"),t.attributes[i].formattedValue=o;return t}function d(e){var t={">":"&gt;","<":"&lt;","'":"&apos;",'"':"&quot;","&":"&amp;"};return e.replace(/([&"<>'])/g,function(e,a){return t[a]})}function p(t){var a;if(e.XMLSerializer){var r=new XMLSerializer;a=r.serializeToString(t)}else a=t.xml;return a}function f(e,t){return g(h(e,t))}function h(e,t){for(var a,r=0,n=e.childNodes.length;n>r;r++)if(a=e.childNodes[r],a.nodeName===t)return a}function v(e,t){for(var a=null,r=0;r<e.attributes.length;r++)if(a=e.attributes[r],a.name===t)return a.value}function g(e){return e.text!==a?e.text:e.textContent}function y(e){var t=e.firstChild.firstChild.firstChild.firstChild,a=h(t,"a:Results"),r=h(a.firstChild,"b:value"),n=h(r,"a:Entities").childNodes;return{entityName:f(r,"a:EntityName"),moreRecords:"true"===f(r,"a:MoreRecords"),pagingCookie:f(r,"a:PagingCookie"),totalRecordCount:parseInt(f(r,"a:TotalRecordCount"),10),entities:$.map(n,m)}}function b(e,t,a){var r=$.parseXML(e),n=$(r).find("fetch");return n.attr("page",t),n.attr("paging-cookie",a),p(r)}function x(e,t){var a=t===!1?!1:!0;return $.ajax({type:"POST",async:a,data:e,url:i()+E,headers:{Accept:"application/xml, text/xml, */*","Content-Type":"text/xml; charset=utf-8",SOAPAction:"http://schemas.microsoft.com/xrm/2011/Contracts/Services/IOrganizationService/Execute"}})}function C(e,t,a,r,n){var i=n===!1?!1:!0,o=['<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">',"  <s:Body>",'    <Execute xmlns="http://schemas.microsoft.com/xrm/2011/Contracts/Services" ','           xmlns:i="http://www.w3.org/2001/XMLSchema-instance">','      <request i:type="b:AssignRequest" xmlns:a="http://schemas.microsoft.com/xrm/2011/Contracts" ','           xmlns:b="http://schemas.microsoft.com/crm/2011/Contracts">','        <a:Parameters xmlns:c="http://schemas.datacontract.org/2004/07/System.Collections.Generic">',"          <a:KeyValuePairOfstringanyType>","            <c:key>Target</c:key>",'            <c:value i:type="a:EntityReference">',"              <a:Id>"+e+"</a:Id>","              <a:LogicalName>"+t+"</a:LogicalName>",'              <a:Name i:nil="true" />',"            </c:value>","          </a:KeyValuePairOfstringanyType>","          <a:KeyValuePairOfstringanyType>","            <c:key>Assignee</c:key>",'            <c:value i:type="a:EntityReference">',"              <a:Id>"+a+"</a:Id>","              <a:LogicalName>"+r+"</a:LogicalName>",'              <a:Name i:nil="true" />',"            </c:value>","          </a:KeyValuePairOfstringanyType>","        </a:Parameters>",'        <a:RequestId i:nil="true" />',"        <a:RequestName>Assign</a:RequestName>","      </request>","    </Execute>","  </s:Body>","</s:Envelope>"].join("");return x(o,i)}function N(e,t){var a=t===!1?!1:!0,r=['<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">'," <s:Body>",'  <Execute xmlns="http://schemas.microsoft.com/xrm/2011/Contracts/Services">','     <request i:type="b:RetrieveMultipleRequest" xmlns:b="http://schemas.microsoft.com/xrm/2011/Contracts" ','         xmlns:i="http://www.w3.org/2001/XMLSchema-instance">','             <b:Parameters xmlns:c="http://schemas.datacontract.org/2004/07/System.Collections.Generic">',"             <b:KeyValuePairOfstringanyType>","                 <c:key>Query</c:key>",'                 <c:value i:type="b:FetchExpression">',"                     <b:Query>",d(e),"                     </b:Query>","                 </c:value>","             </b:KeyValuePairOfstringanyType>","         </b:Parameters>",'         <b:RequestId i:nil="true"/>',"         <b:RequestName>RetrieveMultiple</b:RequestName>","     </request>"," </Execute>","</s:Body></s:Envelope>"].join("");return x(r,a).then(function(e,t,a){return y(e,a)})}function k(e,t){var a=$.Deferred(),r=[],n=t||1,i=null;return N(e,!0).then(function(t){r=r.concat(t.entities),t.moreRecords?(n++,i=b(e,n,t.pagingCookie),k(i,n).then(function(e){r=r.concat(e),a.resolve(r)},a.reject)):a.resolve(r)},a.reject),a.promise()}function R(e,t){var a=t===!1?!1:!0;return N(e,a).then(function(e){return e.entities})}var E="/XRMServices/2011/Organization.svc/web",w=null,S=null;r.prototype.getValue=function(e,t){var r=this.attributes[e];if(r){var n=r.type;switch(n){case"a:EntityReference":return t!==a?r[t]:r.guid;case"a:OptionSetValue":return t!==a?r[t]:r.value;default:return r.value}}return null},e.CrmFetchKit={Fetch:R,FetchMore:N,FetchAll:k,Assign:C}}(window,document);