simpleXrmSoap.min.js

var simpleXrmSoap={request:function(n){var i=Xrm.Page.context.getClientUrl()+"/XRMServices/2011/Organization.svc/web",t;if(window.XMLHttpRequest)t=new XMLHttpRequest;else if(window.ActiveXObject)t=new ActiveXObject("Microsoft.XMLHTTP");else return simpleXrm.error("We encountered an unexpected issue. Please check your form data before proceeding. Info for Admin: User's browser may not support one of the requested scripts. Please attempt using FireFox or IE 8+"),null;t.open("POST",encodeURI(i),!1);t.setRequestHeader("Accept","application/xml, text/xml, */*");t.setRequestHeader("Content-Type","text/xml; charset=utf-8");t.setRequestHeader("SOAPAction","http://schemas.microsoft.com/xrm/2011/Contracts/Services/IOrganizationService/Execute");t.onreadystatechange=n.callback;t.send(n.request)},parseOnReady:function(n){var t=!1;return n.readyState===4&&n.status===200&&(t=!0),t},runWorkflow:function(n){var t='<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Body><Execute xmlns="http://schemas.microsoft.com/xrm/2011/Contracts/Services" xmlns:i="http://www.w3.org/2001/XMLSchema-instance"><request xmlns:a="http://schemas.microsoft.com/xrm/2011/Contracts"><a:Parameters xmlns:b="http://schemas.datacontract.org/2004/07/System.Collections.Generic"><a:KeyValuePairOfstringanyType><b:key>Target<\/b:key><b:value i:type="a:EntityReference"><a:Id>'+n.target.id+"<\/a:Id><a:LogicalName>"+n.target.entityName+'<\/a:LogicalName><a:Name i:nil="true" /><\/b:value><\/a:KeyValuePairOfstringanyType><a:KeyValuePairOfstringanyType><b:key>WorkflowId/b:key><b:value i:type="d:guid" xmlns:d="http://schemas.microsoft.com/2003/10/Serialization/">'+n.workflow.id+'<\/b:value><\/a:KeyValuePairOfstringanyType><\/a:Parameters><a:RequestId i:nil="true" /><a:RequestName>ExecuteWorkflow<\/a:RequestName><\/request><\/Execute><\/s:Body><\/s:Envelope>';simpleXrmSoap.request({request:t,callback:n.callback})}};
/*
//# sourceMappingURL=simpleXrmSoap.min.js.map
*/